{"version": "https://jsonfeed.org/version/1.1", "title": "Paul Withers' Blog", "home_page_url": "https://paulswithers.github.io/", "feed_url": "https://paulswithers.github.io/feed_json_updated.json", "description": "A blog about various HCL software, software development and related learning, from an Lifetime IBM Champion and former HCL Lifetime Ambassador", "icon": null, "authors": [{"name": "Paul S. Withers"}], "language": "en", "items": [{"id": "https://paulswithers.github.io/blog/2016/07/08/welcome/", "url": "https://paulswithers.github.io/blog/2016/07/08/welcome/", "title": "Welcome to My Blog", "content_html": "<h1>Welcome to My Blog</h1>\n<h2>About Me</h2>\n<p>I have been a developer since 2000, primarily with the IBM Domino stack. When IBM introduced XPages, a JSF-based framework, to the stack in 2009 I was one of the early adopters, <a href=\"http://www.intec.co.uk/blog/\">blogging</a>, training, speaking and eventually co-authoring \"XPages Extension Library\" by IBM Press in 2012 and acting as technical editor for \"Mastering XPages 2nd Edition\" by IBM Press in 2014. As a technical evangelist I have been recognised by IBM in their IBM Champion program as an ever-present champion since it's inception for the IBM Collaboration Solutions brand (which includes IBM Domino) in 2011. I've been a committed contributor to open source during that time and I firmly believe in learning through sharing and empowering others. I always try to understand the \"why\" behind the \"what\", and help verbalise that for others too. By sharing code I've learned a great deal from other contributors and through feature requests. Since October 2013 I've been a board member of the open source organisation <a href=\"https://openntf.org/main.nsf\">OpenNTF</a>.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-07-08T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2016/07/12/background-and-purpose/", "url": "https://paulswithers.github.io/blog/2016/07/12/background-and-purpose/", "title": "Background and Purpose", "content_html": "<h1>Background and Purpose</h1>\n<p>For the last six years, I have blogged heavily (375 posts in 3 years and nine months, more than one post per week) on <a href=\"http://www.intec.co.uk/blog/\">Intec's blog</a>. So the question naturally arises why I should choose to start a personal blog, and why now.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-07-12T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2016/07/13/thoughts-on-domino/", "url": "https://paulswithers.github.io/blog/2016/07/13/thoughts-on-domino/", "title": "Thoughts on Domino", "content_html": "<h1>Thoughts on Domino</h1>\n<p>The key to any relationship is periodically stepping back and appreciating the good points in contrast to the little annoyances that grate, so that you're not distracted by the first pretty young face (or muscular torso, depending on your predilection) that you encounter. When you thinking it might be time to leave the relationship, that is the most crucial (though most difficult) time to evaluate honestly and dispassionately what you have / had. Because if you don't, sooner or later you'll find different annoyances that grate; or you'll find something you took for granted and absolutely needed is missing from your new love; and before you know it that love too will turn sour and you'll be crying into your alcohol bemoaning wasted years and shattered dreams while looking at a bank account that's been wiped out by periodic divorce settlements.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-07-13T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2016/07/14/ibm-websphere-liberty/", "url": "https://paulswithers.github.io/blog/2016/07/14/ibm-websphere-liberty/", "title": "IBM Websphere Liberty", "content_html": "<h1>IBM Websphere Liberty</h1>\n<p>IBM Websphere Liberty is a widely-used modern lightweight server (less than 70Mb, I have several running on my PC) that allows modern Java EE development with Java 8. The server is free for development and build server, with limited production use (up to 2Gb of JVM heap space across all instances for the organisation). Web applications are deployed as standard web archives, which means it's easy to download and install demos of various frameworks and easy to use Maven. This is something I've fought with when developing OSGi plugins, because Maven is designed to manage and install dependencies be compilation. On the other hand OSGi best practice is to pull them from other plugins, defined in the MANIFEST.MF. At the very least OSGi needs the plugins adding to the classpath in the MANIFEST.MF. Tycho is designed to bridge the gap between what Maven expects and what OSGi expects, but it's not great. So a standard web application, sucking any jar files in via Maven, makes life a lot easier.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-07-14T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2016/07/26/vaadin/", "url": "https://paulswithers.github.io/blog/2016/07/26/vaadin/", "title": "Vaadin", "content_html": "<h1>Vaadin</h1>\n<p>Before I started working with IBM's XPages framework in 2009, I was starting to use AJAX calls in web applications and starting to dig into Dojo charting options for an application. So not unsurprisingly, when I started with XPages I blogged quite a bit about Dojo charts and understandably chose to write the Dojo-related chapter and a half of <a href=\"https://www.amazon.co.uk/XPages-Extension-Library-Step-step/dp/0132901811\">\"XPages Extension Library\"</a>. I also contributed a <a href=\"https://openntf.org/main.nsf/project.xsp?r=project/Dijit.Tooltip Custom Control\">Dijit Tooltip custom control</a> and an extension to the <a href=\"https://openntf.org/main.nsf/project.xsp?r=project/Dojox.Charting%20Legend%20Extension\">Dojo Legend component</a>, to allow more sophisticated formatting of the legend.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-07-26T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2016/07/30/communication-and-community/", "url": "https://paulswithers.github.io/blog/2016/07/30/communication-and-community/", "title": "Communication and Community", "content_html": "<h1>Communication and Community</h1>\n<blockquote class=\"twitter-tweet\" data-lang=\"en-gb\"><p lang=\"en\" dir=\"ltr\">Communication &amp; transparency are critical to lifeblood of any community, open source or closed. Seeing impacts in more than one community</p>&mdash; Paul Withers (@PaulSWithers) <a href=\"https://twitter.com/PaulSWithers/status/758612998814572544\">28 July 2016</a></blockquote>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-07-30T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2016/08/24/graph-databases/", "url": "https://paulswithers.github.io/blog/2016/08/24/graph-databases/", "title": "Why Graph?", "content_html": "<h1>Why Graph?</h1>\n<p>The bulk of my experience with application development has been building workflow-related rich client and web applications on NoSQL databases, typically IBM Domino. The challenge in the Notes Client was to provide dashboard-style displays and a good way to display documents for action by the current individual. Private views can be used, but impact database performance. So, typically, the approach is to display views that present a  scrollable table of data. Domino's document-level reader security is then used to ensure only the appropriate data is visible. If data is archived appropriately, performance of the database is good enough for many reasonably-sized applications. (Of course, archiving is often omitted from scope of the first phase for the rapidly-developed application, and becomes a case of \"out of sight, out of mind\".) But with the increasing prevalence of web applications replacing Notes Client applications, the ability to display \"my documents\" and use structured searches to display a targeted subset of documents was much easier.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-08-24T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2016/09/20/taking-titan-to-the-next-level/", "url": "https://paulswithers.github.io/blog/2016/09/20/taking-titan-to-the-next-level/", "title": "Taking Titan to the Next Level", "content_html": "<h1>Taking Titan to the Next Level</h1>\n<p>Since earlier this year when I started trying to get a better handle on the breadth of graph database options available for a developer, Titan has been an option I have kept in regular contact with. It's fair to say there has been a lot of uncertainty about the prospects for Titan. But there have been some interesting developments regarding Titan during the summer. IBM Graph has reached GA on Bluemix, albeit with only REST access, which may not appeal to Java developers, particularly those familiar with Titan and comfortable with natively handling vertices and edges. And more recently there has been a lot of work on integrating Titan with ScyllaDb, which provides a long-term option for using Thrift as a communication mechanism between Titan and the backend database.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-09-20T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2016/09/28/impress-evangelist/", "url": "https://paulswithers.github.io/blog/2016/09/28/impress-evangelist/", "title": "How To Impress A Technical Evangelist", "content_html": "<h1>How To Impress A Technical Evangelist</h1>\n<p>I've been involved in developing training materials, tutorials, videos, online documentation and even books. So I've gained a full appreciation of the effort involved in not only creating good documentation but maintaining it too. <a href=\"https://blog.winkelmeyer.com/2016/09/developer-experience-is-important/\">Rene Winkelmeyer</a> wrote a good blog post today about developer experience and his points are very valid.</p>\n<p>Over the last couple of years I've seen a number of approaches as I've dug into a variety of new technologies.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-09-28T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2016/10/20/making-progress/", "url": "https://paulswithers.github.io/blog/2016/10/20/making-progress/", "title": "Making Progress (Bars)", "content_html": "<h1>Making Progress (Bars)</h1>\n<p>Earlier this week I had problems with high CPU utilisation and had to restart my PC. I took the opportunity to bite the bullet and install some Windows Updates. What I saw brought my mind back to UX and coding of applications. For at least five minutes, the progress displayed as \"<strong>100% Complete</strong>\". It prompted me to issue the following tweets:</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en-gb\"><p lang=\"en\" dir=\"ltr\">Developers, progress bar should never show 100% complete. It should be 0% of next process or gone. Windows updates 100% complete for minutes</p>&mdash; Paul Withers (@PaulSWithers) <a href=\"https://twitter.com/PaulSWithers/status/788393811022143488\">18 October 2016</a></blockquote>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-10-20T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2016/10/24/mixing-webxml-and-annotations/", "url": "https://paulswithers.github.io/blog/2016/10/24/mixing-webxml-and-annotations/", "title": "Mixing web.xml and Annotations", "content_html": "<h1>Mixing web.xml and Annotations</h1>\n<p>Over the last few months a lot of what I've had to do has come from combining frameworks. Usually one of those frameworks is <a href=\"https://vaadin.com/home\" title=\"Vaadin\">Vaadin</a>. But whenever you're combining frameworks of any kind, it usually means some content is pre-configured, which may conflict with settings in another framework. If you're not familiar with the framework and the technologies in use, it's a lot like looking at hieroglyphics without a <a href=\"https://en.wikipedia.org/wiki/Rosetta_Stone\">Rosetta Stone</a>! The result is a lot of learning on the job.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-10-24T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2016/11/15/wws-java-api/", "url": "https://paulswithers.github.io/blog/2016/11/15/wws-java-api/", "title": "Creating a Java API to Access Watson Work Services", "content_html": "<h1>Creating a Java API to Access Watson Work Services</h1>\n<p>A few weeks ago, IBM announced Watson Workspace, the final name for Project Toscana, and its API Watson Work Services. The product itself has similarities to Slack or Microsoft Teams, but this post is not about discussing a comparison of the products. It's about the API backing it.</p>\n<p>Watson Work Services is a REST API that uses <a href=\"http://graphql.org/learn\">GraphQL</a>, a method of querying and posting via REST that focuses on configurability. Whereas traditional REST services have fixed endpoints that take fixed parameters and return fixed data objects, GraphQL is a sort of \"API-as-a-service\". You call an endpoint, pass a JSON object determining what elements of which data you want to return, include any dynamic variable values. The queries are passed to an engine at a REST service endpoint which parses the JSON passed, replaces any variables with the dynamically passed values, and returns just what the application or user asks for. This may include data from what, in a traditional REST API application, would be from different REST endpoints. For example, to get members and messages from a space, you might need to make a REST call to get the space ID, then another REST call to get its members, and a third to get the messages.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2016-11-15T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2017/01/13/graph-database-news/", "url": "https://paulswithers.github.io/blog/2017/01/13/graph-database-news/", "title": "Graph Database News", "content_html": "<h1>Graph Database News</h1>\n<p>Last year I <a href=\"./2016-09-20-taking-titan-to-the-next-level.md\">blogged</a> about an initiative to take TitanDb to the Apache Foundation as an incubation project. Yesterday, the next step for TitanDb was announced, when the Linux Foundation <a href=\"https://www.linux.com/blog/Linux-Foundation-welcomes-JanusGraph\">welcomed JanusGraph</a>, a project which uses TitanDb as its starting point. The current <a href=\"http://docs.janusgraph.org/0.1.0-SNAPSHOT/\">documentation</a> will look familiar to anyone who has investigated TitanDb, but the news will be welcomed by the TitanDb community. So it's worth keeping an eye on the <a href=\"http://janusgraph.org/\">JanusGraph website</a>.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2017-01-13T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2017/02/25/ibm-connect-2017/", "url": "https://paulswithers.github.io/blog/2017/02/25/ibm-connect-2017/", "title": "IBM Connect 2017: Embrace Fear", "content_html": "<h1>IBM Connect 2017: Embrace Fear</h1>\n<h2>This Is Not a Vendor Pitch</h2>\n<p>When I began my personal blog last year, I was investigating new technologies beyond the IBM Collaboration Solutions stack. This last week I've been attending and presenting at the conference, including covering one of those new technologies. The experience for me has changed drastically the direction I was heading. But this is not about a vendor's products, this is about the open source technologies I intend to pursue over the next year.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2017-02-25T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2017/04/26/my-dev-tools/", "url": "https://paulswithers.github.io/blog/2017/04/26/my-dev-tools/", "title": "My Development Tools - Part One: Domino and XPages", "content_html": "<h1>My Development Tools - Part One: Domino and XPages</h1>\n<p>I've recently had a new laptop. Since I last had an upgrade of hardware a lot has changed. Back then, I think my development tooling was Domino Designer, a Domino server, and possibly SourceTree. Now the software I needed to install was much more significant. So now is a good time to cover that.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2017-04-26T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2017/05/26/my-dev-tools-2/", "url": "https://paulswithers.github.io/blog/2017/05/26/my-dev-tools-2/", "title": "My Development Tools - Part Two: Beyond Domino", "content_html": "<h1>My Development Tools - Part Two: Beyond Domino</h1>\n<p>Following on from my <a href=\"./2017-04-26-my-dev-tools.md\">last blog post</a> it's now time to move on beyond the tooling related to Domino and XPages.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2017-05-26T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2017/08/17/developing-for-performance/", "url": "https://paulswithers.github.io/blog/2017/08/17/developing-for-performance/", "title": "Developing for Performance", "content_html": "<h1>Developing for Performance</h1>\n<p>One of the themes which crops up from time to time in Domino application development and beyond is the theme of \"performance\". It's a topic which makes me grit my teeth because of the basic premise. Most articles start from what, for me, is a narrow terms of reference: performance optimisation being about how quick a specific amount of data can be served to a specific environment. My interpretation of the term \"performance\" is much wider and that is the reason for my scepticism and concern of how people may interpret or use such articles. There are important points raised, but there are also caveats that need to be borne in mind.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2017-08-17T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2019/09/17/java-outside-domino-eclipse/", "url": "https://paulswithers.github.io/blog/2019/09/17/java-outside-domino-eclipse/", "title": "Java Outside Domino in Eclipse", "content_html": "<h1>Java Outside Domino in Eclipse</h1>\n<p>Recently I've been diving back into running Java outside of the Domino HTTP stack, picking up some work I did quite a few years ago playing with <a href=\"https://github.com/paulswithers/vertx-domino\">Vert.x and Domino</a> based on Stephan Wissel's blog series on <a href=\"https://www.wissel.net/blog/2014/07/adventures-with-vertx-64bit-and-the-ibm-notes-client.html\">Vert.x and Domino</a>. Quite a few things have happened since I was last working on the project, not least the laptop I had at the time got rebuilt, I have got a new laptop, several version of Eclipse have been released and XPages SDK has been deployed to the Eclipse Marketplace (thanks Jesse Gallagher).</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2019-09-17T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2019/10/01/danger-mid-code-pro-code/", "url": "https://paulswithers.github.io/blog/2019/10/01/danger-mid-code-pro-code/", "title": "Danger of Mid Code to Pro Code", "content_html": "<h1>Danger of Mid Code to Pro Code</h1>\n<p>People discussing Domino application development have been using a new term since early this year - \"mid code\". This has become necessary because of the evolution of Domino development since Domino V10.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2019-10-01T00:00:00+00:00", "authors": [], "tags": null}, {"id": "https://paulswithers.github.io/blog/2019/10/10/error-management/", "url": "https://paulswithers.github.io/blog/2019/10/10/error-management/", "title": "Error Management", "content_html": "<h1>Error Management</h1>\n<p>Over the years I've done a lot of development on a variety of platforms. Error management is something developers either bake in from the start, add in later, or never get round to! It seems a good time to review my experiences and my philosophy.</p>\n<p>tl;dr - it varies.</p>", "image": null, "date_modified": "2026-02-01T22:04:44+00:00", "date_published": "2019-10-10T00:00:00+00:00", "authors": [], "tags": null}]}